toDoList/frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `nickname`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('123123123123', '123123123123', '123123123123@123123123123.123123123123', '$2y$13$4b8BUVKreXBmAcOaGC0ZeeewG0WkZiMmdRCVzQXpvQmIJ.yBsqhYK', '_11Jvk_6FtD5bFQvf3OWSXH1AGE-3AY2', 10, 1650801008, 1650801008)
SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`email`='123123123123@123123123123.123123123123')
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->nickname = $this->nickname;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->status = User::STATUS_ACTIVE;
        $user->save();
        $user = User::findByUsername($this->username);